# 1. Написать программу, 
#   которая выводит на экран все числа от 1 до 100.

# for i in range(1 , 101):
#     print(i)

# 2. Написать программу, 
#   которая выводит на экран только четные числа от 1 до 50.

# i = 1

# while i <= 50:
#     if i % 2 == 0:
#         print(i)
#     i += 1 

# 3. Написать программу, 
#   которая запрашивает у пользователя число и выводит 
#   на экран все числа от 1 до этого числа.

# a = int(input("Введите число: "))

# for i in range(1 , a+1):
#     print(i)

    # 4. Написать программу, 
#   которая запрашивает у пользователя число и выводит на экран только четные числа от 1 до этого числа.


# number = int(input("Введите число: "))

# for i in range(0 , number+1):
#      if i % 2 == 0:
#         print(i)


# 5. Написать программу, 
#   которая запрашивает у пользователя слово и выводит на экран его длину.

# words = input('Введите ваше слово: ')
# words = len(words)

# print(f'Ваше слово состоит из {words} букв')

# 6. Написать программу, 
#   которая запрашивает у пользователя слово и выводит на экран его первую букву.

# words = input('Введите ваше слово: ')
# words = words [ :1]
# print(words)

# 7. Написать программу, 
#   которая запрашивает у пользователя число и выводит на экран все его делители.

# number = int(input('Введите  число: '))
# for i in range(1 , number+1):
#     if number % i == 0:
#         print(i)

# 8. Написать программу, 
#   которая запрашивает у пользователя число и выводит на экран только его простые делители

# number = int(input('Введите  число: '))
# for i in range(1 , number):
#     if number % i == 0:
#         i %  2 == 1
#         print(i)


